     **free
         Ctl-opt Nomain;
         Dcl-f Mfg01dsp Workstn Indds(Indds);
         Dcl-ds Indds;
           Exit      Ind  Pos(03);
           Prompt    Ind  Pos(04);
           Refresh   Ind  Pos(05);
           Creupd    Ind  Pos(06);
           Cancel    Ind  Pos(12);
           Empgenrp  Ind  Pos(15);
           Empdobrp  Ind  Pos(16);
           Emprolrp  Ind  Pos(17);
           Empmobrp  Ind  Pos(18);
           Empaddrp  Ind  Pos(19);
           Empemarp  Ind  Pos(20);
           Empstarp  Ind  Pos(21);
           Empnamrp  Ind  Pos(22);
           Emppinrp  Ind  Pos(23);
           Empdojrp  Ind  Pos(24);
           Emppasrp  Ind  Pos(25);
           Empund    Ind  Pos(26);
           Passund   Ind  Pos(27);
         End-ds;
         Dcl-s W_autoid Packed(6:0);
         Dcl-proc Empcrudproc Export;
           Dcl-pi Empcrudproc;
             W_Company    Char  (32);
             Pgmname      Char  (10);
             W_operation  Char  (1);
             W_empid      Packed(6) options(*Nopass);
           End-pi;
           Dow Exit=*Off;
             Dhcomp   = W_Company;
             Dprognam = Pgmname;
             Select;
               When W_operation='C';
                 Dhheader = '       Create Employee';
                 Dfooter  = 'F3=Exit   F5=Refresh   F6=Create';
               When W_operation='U';
                 Dhheader = '       Update Employee';
                 Dfooter  = 'F3=Exit   F5=Refresh   F6=Update';
               When W_operation='D';
                 Dhheader = '       Display Employee'; 
                 Dfooter  = 'F3=Exit   F5=Refresh';
             Endsl;
             Write Header;
             Write Footer; 
             If %Parms()=4;
               Dsply '4';
             Else;
               Exsr Autoincempid;
               Empund  = *On;
               Passund = *On;
               Dempid  = W_autoid;
               Exfmt EMPCRUD;
               If Dempnam=*Blanks;
                 Empnamrp = *On;
                 DERRMSG  = 'Employee Name cannot be Blank';
               Elseif Dempgen=*Blanks;
                 Exsr Turnoffrp;
                 Empgenrp = *On;
                 Derrmsg  = 'Gender Field Cannot be Blank';
               Elseif Dempdob=*Blanks;
                 Exsr Turnoffrp;
                 Empdobrp = *On;
                 DERRMSG  = 'Dob field Cannot be Blank';
               Elseif Demppin=*Zeros;
                 Exsr Turnoffrp;
                 Emppinrp = *On;
                 DERRMSG  = 'Pincode field Cannot be Blank'; 
               Elseif Demprol=*Blanks;
                 Exsr Turnoffrp;
                 Emprolrp = *On;
                 DERRMSG  = 'Role field Cannot be Blank';  
               Elseif Demprol=*Blanks;
                 Exsr Turnoffrp;
                 Emprolrp = *On;
                 DERRMSG  = 'Role field Cannot be Blank';  
               Elseif Dempdoj=*Blanks;
                 Exsr Turnoffrp;
                 Empdojrp = *On;
                 DERRMSG  = 'Doj field Cannot be Blank'; 
               Elseif Dempmob=*Zeros;
                 Exsr Turnoffrp;
                 Empmobrp = *On;
                 DERRMSG  = 'Mobile Number field Cannot be Blank'; 
               Elseif Dempadd=*Blanks;
                 Exsr Turnoffrp;
                 Empaddrp = *On;
                 DERRMSG  = 'Address field Cannot be Blank';  
               Elseif Dempema=*Blanks;
                 Exsr Turnoffrp;
                 Empemarp = *On;
                 DERRMSG  = 'Email field Cannot be Blank';  
               Elseif Dempsta=*Blanks;
                 Exsr Turnoffrp;
                 Empstarp = *On;
                 DERRMSG  = 'State field Cannot be Blank'; 
               Elseif Demppass=*Blanks;
                 Exsr Turnoffrp;
                 Emppasrp = *On;
                 DERRMSG  = 'Password field Cannot be Blank';  
             Endif;

             Endif;

           Enddo;
           Reset Exit;
           Begsr Autoincempid;
             Exec Sql 
               Select Max(Empid) into :W_autoid from Mfgt02emp;
               W_autoid=+1;
           Endsr;
           Begsr Turnoffrp;
             Empnamrp = *Off;
             Empaddrp = *Off;
             Emppinrp = *Off;
             Empdobrp = *Off;
             Empemarp = *Off;
             Empmobrp = *Off;
             Empgenrp = *Off;
             Empstarp = *Off;
             Emppasrp = *Off;
             Emprolrp = *Off;
             Empdojrp = *Off;
             Emppinrp = *Off;
           Endsr;
         End-proc Empcrudproc;