     **free
         Ctl-opt Nomain;
         Dcl-f MFG01DSP Workstn Indds(Indds);
         Dcl-ds Indds;
           Exit    Ind Pos(03);
           Refresh Ind Pos(05);
           Choice  Ind Pos(14);
         End-ds;
         Dcl-pr Adempproc;
           W_Company Char(32);
           Pgmname   Char(10);
         End-pr;
         Dcl-Proc Adhomeproc Export;
           Dcl-pi Adhomeproc;
             W_Company char(32);
             Pgmname   char(10);
           End-pi;
          Dow Exit=*OFF;
            Dhcomp   = W_Company;
            Dhheader = '       Admin Options';
            Dprognam = Pgmname;
            Dfooter  = 'F3=Exit   F5=Refresh';
            Dhopt1   = ' 1. Manage Employee Account';
            Dhopt2   = ' 2. Manage Location';
            Dhopt3   = ' 3. Manage Product';
            Dhopt4   = ' 4. Manage Bom';
            Dhopt5   = ' 5. Manage Work Order';
            Dhopt6   = ' 6. Manage Inventory';
            Dhopt7   = '99. Signoff';
            Write Header;
            Write Footer;
            Exfmt Home;
            If Refresh=*On;
              Exsr Homeclear;
            Endif;
            If Dchoice<>*Zeros;
              Select;
                When Dchoice=1;
                  Exsr Homeclear;
                  Adempproc(W_Company:Pgmname);
              Endsl;
            Else;
              Choice=*Off;
            Endif;
          Enddo;
          Reset Exit;
         Begsr Homeclear;
           Clear Derrmsg;
           Clear Dchoice;
           Choice  = *off;
           Refresh = *Off;
         Endsr;
         End-Proc Adhomeproc;

