     **free
         Ctl-opt Nomain;
         Dcl-f Mfg01dsp Workstn Indds(Indds);
         Dcl-ds Indds;
           Refresh Ind Pos(05);
           Choice  Ind Pos(14);
         End-ds;
         Dcl-s Exit Zoned(1) Inz(1);
         Dcl-s W_operation Char(1);
         Dcl-pr Empcrudproc;
             W_Company    Char  (32);
             Pgmname      Char  (10);
             W_operation  Char  (1);
             W_emptyp     Varchar(1);
             W_usrid      Packed(6) options(*Nopass);
         End-pr;
         Dcl-proc Prhomeproc Export;
           Dcl-pi Prhomeproc;
             W_Company char(32);
             Pgmname   char(10);
             W_usrid   Packed(6);
             W_emptyp  VarChar(1);
           End-pi;
           Dow Exit=1;
             Dhcomp   = W_Company;
             Dhheader = '  Product Manager Options';
             Dprognam = Pgmname;
             Dfooter  = 'F5=Refresh';
             Dhopt1   = '1. Create Product';
             Dhopt2   = '2. Manage Product';
             Dhopt3   = '3. Dispaly Profile';
             Dhopt4   = '4. Update Profile';
             Write Header;
             Write Footer;
             Exfmt Home;
             Select;
               When Refresh=*On;
                 Exsr Homeclear;
               When Dchoice=1;
                 Dsply 'hello1';
               When Dchoice=2;
                 Dsply 'hello2';
               When Dchoice=3;
                 W_operation='D';
                 Empcrudproc(W_Company:Pgmname:W_operation
                 :W_emptyp:W_usrid);
                 Clear W_operation;
               When Dchoice=4;
                 W_operation='U';
               Empcrudproc(W_Company:Pgmname:W_operation
                                          :W_emptyp:W_usrid);
               When Dchoice=99;
                 Leave;
             Endsl;
             Exsr Homeclear;
           Enddo;
           Exsr Homeclear;
          Begsr Homeclear;
           Clear Derrmsg;
           Clear Dchoice;
           Clear Dhopt1;
           Clear Dhopt2;
           Clear Dhopt3;
           Clear DHOPT4;
           Clear DHOPT5;
           Clear Dhopt6;
           Clear Dhopt7;
           Choice  = *off;
           Refresh = *Off;
           Exit=1;
         Endsr;
         End-proc Prhomeproc;
